exporters/ox-overview.org
# Created 2021-06-15 Tue 18:23
#+OPTIONS: H:3 num:nil toc:t \n:nil ::t |:t ^:t -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+TITLE: The New Org-mode Exporter Framework
#+AUTHOR: John Henderson
#+startup: align fold nodlcheck hidestars oddeven lognotestate hideblocks
#+seq_todo: TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+tags: Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+language: en
#+style: <style type="text/css">#outline-container-introduction{ clear:both; }</style>
#+html_link_up: ../ox-overview.html
#+html_link_home: https://orgmode.org/worg/
#+exclude_tags: noexport

[[file:index.org][{Back to Worg's index}]]

* Introduction

As of release 8.0, Org-mode has transitioned to a new export framework, authored
primarily (/entirely?/) by Nicolas Goaziou...

#+begin_example

Perhaps this could be filled in with some of the technical reasons and advantages
of the new exporter by Nicolas or someone else familiar with with it's inner workings?
#+end_example

For instructions on how to upgrade from the previous Org-mode exporter, see
[[file:../org-8.0.org][the upgrade guide]].

Nicolas' official announcement of the exporter may be viewed at the [[https://orgmode.org/list/876229nrxf.fsf@gmail.com][Org-mode mailing list
post]]. This document presents an overview of features, as well as a list of currently
supported exporter backends. [[https://orgmode.org/manual/Exporting.html#Exporting][Exporting]] and [[https://orgmode.org/manual/Publishing.html#Publishing][publishing]] are also documented in the [[https://orgmode.org/manual/][Org-mode
manual]]. See [[file:ox-docstrings.org][ox-docstrings]] and [[file:org-element-docstrings.org][org-element-docstrings]] for the extracted
docstrings from these two core libraries of the new Org-mode exporter, i.e.
for detailled technical information about the exporter framework.

* List of Org-mode exporters

Please find below a list of current Org-mode exporters, the location of the backend elisp
file (relative to downloaded Org-mode installation directory, =org=) and links Worg and
Org-mode manual documentation.

| *Name*                                                                                            | *Exporter location*                | *Worg Tutorial*                                         | *Org-mode Manual*                                                                                                                                     |
|---------------------------------------------------------------------------------------------------+------------------------------------+---------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------|
| ASCII                                                                                             | =./lisp/ox-ascii.el=               | ox-ascii                                                | [[https://orgmode.org/manual/ASCII_002fLatin_002d1_002fUTF_002d8-export.html#ASCII_002fLatin_002d1_002fUTF_002d8-export][ASCII/Latin-1/UTF-8 export]] |
| [[https://bitbucket.org/rivanvx/beamer/wiki/Home][Beamer]]                                        | =./lisp/ox-beamer.el=              | [[file:beamer/ox-beamer.org][ox-beamer]]                | [[https://orgmode.org/manual/Beamer-export.html#Beamer-export][Beamer class export]]                                                                  |
| HTML                                                                                              | =./lisp/ox-html.el=                | ox-html                                                 | [[https://orgmode.org/manual/HTML-export.html#HTML-export][HTML export]]                                                                              |
| [[https://en.wikipedia.org/wiki/ICalendar][iCalendar]]                                            | =./lisp/ox-icalandar.el=           | ox-icalendar                                            |                                                                                                                                                       |
| [[http://www.latex-project.org/][LaTeX]]                                                          | =./lisp/ox-latex.el=               | ox-latex                                                | [[https://orgmode.org/manual/LaTeX-export.html#LaTeX-export][LaTeX export]]                                                                           |
| [[http://manpages.bsd.lv/history.html][Man]]                                                      | =./lisp/ox-man.el=                 | ox-man                                                  |                                                                                                                                                       |
| [[http://daringfireball.net/projects/markdown/][Markdown]]                                        | =./lisp/ox-md.el=                  | ox-md                                                   |                                                                                                                                                       |
| [[http://opendocumentformat.org/][ODT]]                                                           | =./lisp/ox-odt.el=                 | ox-odt                                                  | [[https://orgmode.org/manual/OpenDocument-Text-export.html#OpenDocument-Text-export][OpenDocument Text export]]                                       |
| [[https://orgmode.org/manual/Publishing.html][Publishing]]                                        | =./lisp/ox-publish.el=             | ox-publish                                              | [[https://orgmode.org/manual/Publishing.html#Publishing][Publishing]]                                                                                 |
| [[http://www.gnu.org/software/texinfo/][Texinfo]]                                                 | =./lisp/ox-texinfo.el=             | ox-texinfo                                              |                                                                                                                                                       |
|---------------------------------------------------------------------------------------------------+------------------------------------+---------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------|
| [[http://www.atlassian.com/software/confluence/overview/team-collaboration-software][Confluence]] | =./contrib/lisp/ox-confluence.el=  | ox-confluence                                           |                                                                                                                                                       |
| [[http://imakewebthings.com/deck.js/][Deck.js]]                                                   | =./contrib/lisp/ox-deck.el=        | ox-deck                                                 |                                                                                                                                                       |
| [[http://freemind.sourceforge.net/wiki/index.php/Main_Page][Freemind]]                            | =./contrib/lisp/ox-freemind.el=    | ox-freemind                                             |                                                                                                                                                       |
| [[http://www.gnu.org/software/groff/][Groff]]                                                     | =./contrib/lisp/ox-groff.el=       | ox-groff                                                |                                                                                                                                                       |
| [[http://www.ctan.org/pkg/koma-script][Koma Scrlttr2]]                                            | =./contrib/lisp/ox-koma-letter.el= | ox-koma-letter                                          |                                                                                                                                                       |
| [[http://www.rssboard.org/rss-specification][RSS]]                                                | =./contrib/lisp/ox-rss.el=         | ox-rss                                                  |                                                                                                                                                       |
| [[http://meyerweb.com/eric/tools/s5/][S5]]                                                        | =./contrib/lisp/ox-s5.el=          | ox-s5                                                   |                                                                                                                                                       |
| [[http://www.taskjuggler.org/][Taskjuggler]]                                                      | =./contrib/lisp/ox-taskjuggler.el= | [[file:taskjuggler/ox-taskjuggler.org][ox-taskjuggler]] |                                                                                                                                                       |
|---------------------------------------------------------------------------------------------------+------------------------------------+---------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------|
| [[http://www.docbook.org/][DocBook]]                                                              | (1)                                | -                                                       | -                                                                                                                                                     |

- (1) DocBook export, available in previous Org-mode versions, has not currently been ported
  to the new exporter, however the new =ox-texinfo= backend can generate DocBook
  format. Once =file.texi= is created via =ox-texinfo=, simply execute:

#+begin_example
makeinfo --docbook file.texi
#+end_example

* General Documentation

/This page is in progress. Please be patient as it is updated./
